# ResetOrientation3D

## Description
ResetOrientation3D resets the 3D environment parameters of the active Vectorworks document. &lt;BR&gt;
&lt;BR&gt;
Call this procedure after 3D object creation to ensure correct orientation and display of the new object in 3D space.&lt;BR&gt;
&lt;BR&gt;

```pascal
PROCEDURE ResetOrientation3D;
```

```python

def vs.ResetOrientation3D():
    return None
```

## Examples
```pascal
Poly3D(1,1,0,1.5,1.5,1,2.5,1.5,1,);

ResetOrientation3D;

```

## Version
Availability: from MiniCAD5.0.2
## Category
* General Edit